{"class_name": "Sequential", "keras_version": "2.1.6-tf", "backend": "tensorflow", "config": [{"class_name": "Conv2D", "config": {"filters": 32, "data_format": "channels_last", "name": "conv2d", "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "dtype": "float32", "mode": "fan_avg", "scale": 1.0}}, "bias_regularizer": null, "kernel_size": [3, 3], "dtype": "float32", "use_bias": true, "padding": "same", "batch_input_shape": [null, 32, 32, 3], "trainable": true, "activation": "linear", "dilation_rate": [1, 1], "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "activity_regularizer": null, "bias_constraint": null}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation", "dtype": "float32"}}, {"class_name": "Conv2D", "config": {"filters": 32, "data_format": "channels_last", "name": "conv2d_1", "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "dtype": "float32", "mode": "fan_avg", "scale": 1.0}}, "bias_regularizer": null, "kernel_size": [3, 3], "dtype": "float32", "use_bias": true, "padding": "valid", "trainable": true, "activation": "linear", "dilation_rate": [1, 1], "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "activity_regularizer": null, "bias_constraint": null}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_1", "dtype": "float32"}}, {"class_name": "MaxPooling2D", "config": {"padding": "valid", "data_format": "channels_last", "name": "max_pooling2d", "strides": [2, 2], "trainable": true, "pool_size": [2, 2], "dtype": "float32"}}, {"class_name": "Dropout", "config": {"trainable": true, "seed": null, "name": "dropout", "rate": 0.25, "noise_shape": null, "dtype": "float32"}}, {"class_name": "Conv2D", "config": {"filters": 64, "data_format": "channels_last", "name": "conv2d_2", "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "dtype": "float32", "mode": "fan_avg", "scale": 1.0}}, "bias_regularizer": null, "kernel_size": [3, 3], "dtype": "float32", "use_bias": true, "padding": "same", "trainable": true, "activation": "linear", "dilation_rate": [1, 1], "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "activity_regularizer": null, "bias_constraint": null}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_2", "dtype": "float32"}}, {"class_name": "Conv2D", "config": {"filters": 64, "data_format": "channels_last", "name": "conv2d_3", "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "dtype": "float32", "mode": "fan_avg", "scale": 1.0}}, "bias_regularizer": null, "kernel_size": [3, 3], "dtype": "float32", "use_bias": true, "padding": "valid", "trainable": true, "activation": "linear", "dilation_rate": [1, 1], "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "activity_regularizer": null, "bias_constraint": null}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_3", "dtype": "float32"}}, {"class_name": "MaxPooling2D", "config": {"padding": "valid", "data_format": "channels_last", "name": "max_pooling2d_1", "strides": [2, 2], "trainable": true, "pool_size": [2, 2], "dtype": "float32"}}, {"class_name": "Dropout", "config": {"trainable": true, "seed": null, "name": "dropout_1", "rate": 0.25, "noise_shape": null, "dtype": "float32"}}, {"class_name": "Flatten", "config": {"trainable": true, "data_format": "channels_last", "name": "flatten", "dtype": "float32"}}, {"class_name": "Dense", "config": {"name": "dense", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "dtype": "float32", "mode": "fan_avg", "scale": 1.0}}, "bias_regularizer": null, "dtype": "float32", "use_bias": true, "bias_constraint": null, "units": 512, "kernel_constraint": null, "activation": "linear", "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "activity_regularizer": null}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_4", "dtype": "float32"}}, {"class_name": "Dropout", "config": {"trainable": true, "seed": null, "name": "dropout_2", "rate": 0.5, "noise_shape": null, "dtype": "float32"}}, {"class_name": "Dense", "config": {"name": "dense_1", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "dtype": "float32", "mode": "fan_avg", "scale": 1.0}}, "bias_regularizer": null, "dtype": "float32", "use_bias": true, "bias_constraint": null, "units": 10, "kernel_constraint": null, "activation": "linear", "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "activity_regularizer": null}}]}